# Вы можете расположить сценарий своей игры в этом файле.

# Определение персонажей игры.
define b = Character('Бред', color="#7ef17e")
define s = Character('Сом', color="#cd6af5")
# Вместо использования оператора image можете просто
# складывать все ваши файлы изображений в папку images.
# Например, сцену bg room можно вызвать файлом "bg room.png",
# а eileen happy — "eileen happy.webp", и тогда они появятся в игре.

# Игра начинается здесь:
label start:

    scene bg room

    b"Привет я текст-долбаеб"
    b"Я полный бред и сделан для того чтобы делать вид наполнения игры текстом и диалогами"
    "Это чистая правда это текст-бред-долбаеб"
    "И все что он делает это кажется текстом игры"
    "А на сомом деле это просто наполнения для тестировки интерфейса и всякой прочей требухи"
    s"Каким сомом, еблан?"
    "Тапки"

    Как-то раз, в первые дни лета 2017 года в одну квартиру на юге Нижнего Новгорода постучались.
Дверь открыла молодая девушка. Она обняла пришедшую к ней подругу.
Настя: Дратути! Ну наконец-то можем пойти погулять!
Катя: Привет! да, я так рада!
Настя: Блин, нифига ты модная! Это, что Гоша?
Катя: Да, недавно купила. Ну что, пойдём?
Настя: Да, погнали.
Оживлённо разговаривая, девчонки дошли до остановки и сели на троллейбус в центр города.
Катя: Тут одно место.
Настя: Да садись, я постою.
Катя: Блин, я так рада, что наконец-то каникулы. Что мы с тобой сейчас едем гулять.
Настя: Да, а то ты со своим лицеем из учёбы совсем не вылезаешь.
Катя: Ну а что, надо было всё сдать. Прикинь, у нас на прошлой неделе шли контрольные.
Настя: Ну и че, у нас тоже.
Катя: У нас ещё по ЕГЭ было. день по математике, день по физике. Ещё зачёт по биологии, где надо было билеты учить.
nvl
Долго ли, коротко ли, девчонки доехали до большой красивой площади с памятником пролетарскому писателю. И тут как бы типичный сценарий прогулки любого уважающего себя нижегородца – по главной улице до местного Кремля, но Катя начала ныть.
Катя: Да мы тут тыщу раз были, Насть!
Настя: Ладно, знаю одно место.
Настя повела Катю через арку по улицам и переулкам центра. Пройдя дворами они внезапно вышли на стадион.
Тот самый стадион, снявшийся в фильме Балабанова.
Катя: Блин, нифига, не знала, что тут пройти можно. Мы сюда на физру ходим из лицея, но другой дорогой.
Катя с Настей ушли подальше от оффников, на другой конец и забрались на гаражи.
Настя: Ну, наконец-то.
Катя: Насть, тут жарко.
Настя: Да хорош, тебе всё не нравится. У меня есть чем охладиться.
Настя достала из своей сумки… две бутылки гаража.
Катя оторопела.
Катя: Насть, я ж не пью.
Настя: Да ладно те, тут немного.
Катя: Ну я не знаю.
Настя: Давай, те подруга предлагает.
Катя поломалась, поборолась с собой внутри и согласилась.
Настя: Ну, за окончание десятого!
Девчонки звонко чокнулись бутылками.
Следующие несколько минут можно охарактеризовать так: на крыше гаража Настя уговорила Катю уговорить совместно бутылку-другую гаража.
Всё было обсуждено: пацаны, бурно развивающиеся в тот год мода и культура мемов.
Не забыли на этом празднике жизни и про музыку: Настя прихватила с собой портативный жи-би-эль, благодаря которому июньский день окончательно перестал быть томным.
Алкоголь нехило подействовал на светловолосую ботанку, возможно сказались недавние бессонные ночи.
Настя: А вот это новая группа, послушай.
Из колонки полилась современная бодрая перепевка песенки группы Рефлекс.
Катя встала и начала дэнсить настолько, насколько ей, фанатке биологии, позволяли навыки.
Но в тот момент она не замечала никаких проблем с попаданием в ритм, изящностью движений и т.д.
Как и не заметила футбольного мяча, вылетевшего из-за барьера и коршуном спикировавшего на её умную голову.
    return