
define nas = Character('Настя', color="#7ef17e")
define kat = Character('Катя', color="#cd6af5")

# Игра начинается здесь:
label start:

    scene bg test
    "Как-то раз, в первые дни лета 2017 года в одну квартиру на юге Нижнего Новгорода постучались."
    "Дверь открыла молодая девушка. Она обняла пришедшую к ней подругу."
    nas "Дратути! Ну наконец-то можем пойти погулять!"
    kat "Привет! да, я так рада!"
    nas "Блин, нифига ты модная! Это, что Гоша?"
    kat "Да, недавно купила. Ну что, пойдём?"
    nas "Да, погнали."
    "Оживлённо разговаривая, девчонки дошли до остановки и сели на троллейбус в центр города."
    kat "Тут одно место."
    nas "Да садись, я постою."
    kat "Блин, я так рада, что наконец-то каникулы. Что мы с тобой сейчас едем гулять."
    nas "Да, а то ты со своим лицеем из учёбы совсем не вылезаешь."
    kat "Ну а что, надо было всё сдать. Прикинь, у нас на прошлой неделе шли контрольные."
    nas "Ну и че, у нас тоже."
    kat "У нас ещё по ЕГЭ было. день по математике, день по физике. Ещё зачёт по биологии, где надо было билеты учить."
    #nvl
    "Долго ли, коротко ли, девчонки доехали до большой красивой площади с памятником пролетарскому писателю. И тут как бы типичный сценарий прогулки любого уважающего себя нижегородца – по главной улице до местного Кремля, но Катя начала ныть."
    kat "Да мы тут тыщу раз были, Насть!"
    nas "Ладно, знаю одно место."
    "Настя повела Катю через арку по улицам и переулкам центра. Пройдя дворами они внезапно вышли на стадион."
    "Тот самый стадион, снявшийся в фильме Балабанова."
    kat "Блин, нифига, не знала, что тут пройти можно. Мы сюда на физру ходим из лицея, но другой дорогой."
    "Катя с Настей ушли подальше от оффников, на другой конец и забрались на гаражи."
    nas "Ну, наконец-то."
    kat "Насть, тут жарко."
    nas "Да хорош, тебе всё не нравится. У меня есть чем охладиться."
    "Настя достала из своей сумки… две бутылки гаража."
    "Катя оторопела."
    kat "Насть, я ж не пью."
    nas "Да ладно те, тут немного."
    kat "Ну я не знаю."
    nas "Давай, те подруга предлагает."
    "Катя поломалась, поборолась с собой внутри и согласилась."
    nas "Ну, за окончание десятого!"
    "Девчонки звонко чокнулись бутылками."
    "Следующие несколько минут можно охарактеризовать так: на крыше гаража Настя уговорила Катю уговорить совместно бутылку-другую гаража."
    "Всё было обсуждено: пацаны, бурно развивающиеся в тот год мода и культура мемов."
    "Не забыли на этом празднике жизни и про музыку: Настя прихватила с собой портативный жи-би-эль, благодаря которому июньский день окончательно перестал     быть томным."
    "Алкоголь нехило подействовал на светловолосую ботанку, возможно сказались недавние бессонные ночи."
    nas "А вот это новая группа, послушай."
    "Из колонки полилась современная бодрая перепевка песенки группы Рефлекс."
    "Катя встала и начала дэнсить настолько, насколько ей, фанатке биологии, позволяли навыки."
    "Но в тот момент она не замечала никаких проблем с попаданием в ритм, изящностью движений и т.д."
    "Как и не заметила футбольного мяча, вылетевшего из-за барьера и коршуном спикировавшего на её умную голову."
    return